---
kind: property
id: P:Autodesk.Revit.DB.Document.CreationGUID
zh: 文档、文件
source: html/4d2418fc-e00a-f5b8-609e-8f027eeed992.htm
---
# Autodesk.Revit.DB.Document.CreationGUID Property

**中文**: 文档、文件

A unique identifier generated when the Document was first created.

## Syntax (C#)
```csharp
public Guid CreationGUID { get; }
```